COL_TO_PARAM = {
    'B': 'email',
    'C': 'oblast',
    'E': 'name',
    'F': 'grade',
    'G': 'p1',
    'H': 'p2',
    'I': 'p3',
    'J': 'p4',
    'K': 'p5',
    'L': 'p6',
    'M': 'p7',
    'N': 'p8',
    'O': 'p2-1',
    'P': 'p2-2', # GHIJKLMNOP
}

P_TO_JURY = {
    9: {
        'p1': 'Тасанов А.',
        'p2': 'Тасанов А.',
        'p3': 'Черданцев В.',
        'p4': 'Моргунов А.',
        'p5': 'Тайшыбай А.',
        'p6': 'Черданцев В.',
        'p7': 'Молдагулов Г.',
        'p2-1': 'Молдагулов Г.'
    },
    10: {
        'p1': 'Бекхожин Ж.',
        'p2': 'Моргунов А.',
        'p3': 'Тайшыбай А.',
        'p4': 'Загрибельный Б.',
        'p5': 'Мадиева М.',
        'p6': 'Молдагулов Г.',
        'p7': 'Бекхожин Ж.',
        'p2-1': 'Бекхожин Ж.',
        'p2-2': 'Черданцев В.'
    },
    11: {
        'p1': 'Мадиева М.',
        'p2': 'Моргунов А.',
        'p3': 'Тайшыбай А.',
        'p4': 'Загрибельный Б.',
        'p5': 'Мадиева М.',
        'p6': 'Моргунов А.',
        'p7': 'Тайшыбай А.',
        'p8': 'Загрибельный Б.',
        'p2-1': 'Молдагулов Г.',
        'p2-2': 'Черданцев В.'
    }
}